Repository: First-Aid-Flutter-App/FirstAid
Catalog: lib/l10n/intl_*.arb
Languages: ru

# appTitle
source: First Aid Helper App
ru: Справочник первой помощи

# situations
source: First Aid situations
ru: Черезвычайные ситуации

source: Injuries
ru: Травмы

# injuriesStep1
source: Step 1: Assess the situation
ru: Шаг 1: Оцените ситуацию

# injuriesStep2
source: Step 2: Stop the bleeding
ru: Шаг 2: Остановите кровотечение

# injuriesStep3
source: Step 3: Clean the wound
ru: Шаг 3: Очистите рану

# injuriesStep4
source: Step 4: Bandage the wound
ru: Шаг 4: Забинтуйте рану

source: Fainting
ru: Обморок

# faintingStep1
source: Step 1: Lay the person down
ru: Шаг 1: Уложите человека

# faintingStep2
source: Step 2: Elevate their legs
ru: Шаг 2: Поднимите ноги

# faintingStep3
source: Step 3: Check for breathing
ru: Шаг 3: Проверьте дыхание

source: Heart Attack
ru: Сердечный приступ

# heartAttackStep1
source: Step 1: Call emergency services
ru: Шаг 1: Вызовите скорую помощь

# heartAttackStep2
source: Step 2: Keep the person calm
ru: Шаг 2: Успокойте человека

# heartAttackStep3
source: Step 3: Administer CPR if needed
ru: Шаг 3: Проведите СЛР, если это необходимо

source: Asphyxia
ru: Асфиксия

# asphyxiaStep1
source: Step 1: Check for obstruction
ru: Шаг 1: Проверьте наличие препятствия

# asphyxiaStep2
source: Step 2: Encourage coughing
ru: Шаг 2: Поддержите кашель

# asphyxiaStep3
source: Step 3: Administer back blows if necessary
ru: Шаг 3: Проведите удары по спине, если необходимо

source: Bleeding
ru: Кровотечение

# bleedingStep1
source: Step 1: Apply direct pressure
ru: Шаг 1: Приложите прямое давление

# bleedingStep2
source: Step 2: Elevate the wound
ru: Шаг 2: Поднимите раненую часть тела

# bleedingStep3
source: Step 3: Seek medical help if needed
ru: Шаг 3: Обратитесь за медицинской помощью, если необходимо

source: Heat Strokes
ru: Тепловые удары

# heatStrokesStep1
source: Step 1: Move to a cool place
ru: Шаг 1: Переместите в прохладное место

# heatStrokesStep2
source: Step 2: Apply cool cloths
ru: Шаг 2: Приложите холодные компрессы

# heatStrokesStep3
source: Step 3: Seek medical assistance if symptoms persist
ru: Шаг 3: Обратитесь за медицинской помощью, если симптомы сохраняются

source: Burn
ru: Ожог

# burnStep1
source: Step 1: Cool the burn under running water
ru: Шаг 1: Охладите ожог под проточной водой

# burnStep2
source: Step 2: Cover with a clean cloth
ru: Шаг 2: Накройте чистой тканью

# burnStep3
source: Step 3: Do not apply ice directly
ru: Шаг 3: Не прикладывайте лед напрямую

source: Electric Injuries
ru: Электрические травмы

# electricInjuriesStep1
source: Step 1: Call emergency services
ru: Шаг 1: Вызовите скорую помощь

# electricInjuriesStep2
source: Step 2: Do not touch the person if they are still in contact with the source
ru: Шаг 2: Не прикасайтесь к человеку, если он все еще в контакте с источником

# electricInjuriesStep3
source: Step 3: Perform CPR if necessary and trained
ru: Шаг 3: Проведите СЛР, если это необходимо и вы обучены

# selectInjury
source: First Aid
ru: Первая помощь

source: CPR Guide
ru: Руководство по СЛР

source: My Profile
ru: Моя карточка

source: First Aid Steps
ru: Шаги по оказанию первой помощи

source: My Health Info
ru: Моя медицинская карточка

source: Blood Type
ru: Группа крови

source: Allergies
ru: Аллергии

source: Medical Conditions
ru: Медицинские состояния

source: Save Info
ru: Сохранить информацию

# healthInfoSaved
source: Health information saved!
ru: Медицинская информация сохранена!

# cprStep1Title
source: Step 1: Check if the person is breathing.
ru: Шаг 1: Проверьте, дышит ли человек.

# cprStep1Text
source: Place your ear above the person's mouth, looking at the chest and search for signs of breathing.
ru: Приклоните ухо к рту человека, смотря на грудь, и ищите признаки дыхания.

# cprStep2Title
source: Step 2: Begin chest compressions.
ru: Шаг 2: Начните сердечно-легочную реанимацию.

# cprStep2Text
source: Place your hands in the center of the chest and push hard and fast at a rate of 100-120 compressions per minute.
ru: Поместите руки в центр груди и надавите сильно и быстро со скоростью 100-120 компрессий в минуту.

# cprStep3Title
source: Step 3: Give rescue breaths.
ru: Шаг 3: Сделайте искусственное дыхание.

# cprStep3Text
source: Tilt the person's head back, lift the chin, pinch the nose, and give 2 rescue breaths, each lasting about 1 second.
ru: Откиньте голову человека назад, поднимите подбородок, зажмите нос и сделайте 2 вдоха, каждый длится около 1 секунды.

# cprStep4Title
source: Step 4: Repeat the cycle.
ru: Шаг 4: Повторяйте цикл.

# cprStep4Text
source: Continue giving 30 chest compressions followed by 2 rescue breaths until help arrives.
ru: Продолжайте делать 30 нажатий на грудь, за которыми следуют 2 вдоха, пока не приедет помощь.

# cprBreathPromptTitle
source: Give 2 Rescue Breaths
ru: Сделайте 2 вдоха

# cprBreathPromptText
source: Press 'Continue' after performing the rescue breaths.
ru: Нажмите 'Продолжить' после выполнения вдохов.

source: Start CPR Timer
ru: Начать таймер СЛР

# stopCprTimer
source: Stop
ru: Остановить

# continueButton
source: Continue
ru: Продолжить
